{"pageProps":{"data":[{"lang":"cn","banner":{"title":"公司简介","content":"  "},"content":[{"subtitle":"一、背景和目标","description":"<p>像 Google Ajax Library，Microsoft ASP.net CDN，SAE，Baidu，Upyun 等 CDN 上都免费提供的 JS 库的存储，但使用起来却都有些局限，因为他们只提供了部分 JS 库。当然，我们还可以有像 CDNJS 这样的平台，存储了大部分主流的 JS 库，甚至 CSS、image 和 swf，但国内的访问速度却不是很理想，并且缺少很多国内优秀开源库。</p> <p>因此，我们提供这样一个仓库，让它尽可能全面收录优秀的开源库，并免费为之提供 CDN 加速服务，使之有更好的访问速度和稳定的环境。同时，我们也提供开源库源接入的入口，让所有人都可以提交开源库，包括 JS、CSS、image 和 swf 等静态文件。</p>"},{"subtitle":"二、更新开源库","description":"<p>理论上我们自动更新库的版本文件，并且不会删除旧版本，但如果你在 <a href='https://www.staticfile.net' target='_blank'>www.staticfile.net</a> 找不到最新的版本，则可以通过往该库中添加一个版本目录，并且修改相应的 package.json 文件，利用 Pull Request 来提醒我们。</p><p>因此，我们提供这样一个仓库，让它尽可能全面收录优秀的开源库，并免费为之提供 CDN 加速服务，使之有更好的访问速度和稳定的环境。同时，我们也提供开源库源接入的入口，让所有人都可以提交开源库，包括 JS、CSS、image 和 swf 等静态文件。</p>"},{"subtitle":"三、使用注意","description":"<p>虽然大多数库都是基于 MIT / BSD License 开源的，但在有某些库在个人/商业应用上是有区别的，比如 Highcharts 这个库，所以请大家在使用这些库的时候，最好能点击其网站、代码仓库（在搜索结果中有链接）中查看其开源协议。</p>"},{"subtitle":"四、作者和服务商","description":"<p>当前维护者：</p> <p><a href='https://github.com/ikbear' target='_blank'>• ikbear</a></p> <p><a href='https://github.com/iwillwen' target='_blank'>• iwillwen</a></p> <p><a href='https://github.com/DL-strong' target='_blank'>• 漩涡</a></p> <p>历史维护者：</p> <p><a href='https://github.com/sofish' target='_blank'>• Sofish</a></p> <p><a href='https://github.com/hfcorriez' target='_blank'>• hfcorriez</a></p> <p><a href='https://github.com/sorcerer-ma' target='_blank'>• 马逸清 </a></p> 此仓库由内忧秀的云存储服务商 <a href='https://www.qiniu.com/' target='_blank'>七牛云</a> 提供存储和加速赞助。同步国外 <a href='https://cdnjs.com' target='_blank'>CDNS</a> 源站，同时由国内开源贡献值提交其它有价值的库。感谢所有开源库作者和挖掘者的努力。"},{"subtitle":"五、开源协议","description":"仓库基于MIT License 开源。"}]},{"lang":"en","banner":{"title":"Company Profile","content":"  "},"content":[{"subtitle":"1. Background and objectives","description":"<p>CDNs such as Google Ajax Library, Microsoft ASP.net CDN, SAE, Baidu, Upyun, etc. all provide free JS library storage, but their use is somewhat limited because they only provide some JS libraries. Of course, we can also have a platform like CDNJS, which stores most of the mainstream JS libraries, even CSS, image and swf, but the domestic access speed is not very ideal, and there is a lack of many excellent domestic open source libraries. </p><p>Therefore, we provide such a warehouse to include as many excellent open source libraries as possible, and provide CDN acceleration services for free to provide better access speed and stable environment. At the same time, we also provide access to open source libraries so that everyone can submit open source libraries, including static files such as JS, CSS, images, and swf. </p>"},{"subtitle":"2. Update the open source library","description":"<p>Theoretically we automatically update the version file of the library and will not delete the old version, but if you are in <a href='https://www.staticfile.net' target='_blank'>www.staticfile.net</a> If the latest version cannot be found, you can add a version directory to the library, modify the corresponding package.json file, and use Pull Request to remind us. </p><p>Therefore, we provide such a warehouse to include as many excellent open source libraries as possible, and provide it with CDN acceleration services for free, so that it can have better access speed and a stable environment. At the same time, we also provide access to open source libraries so that everyone can submit open source libraries, including static files such as JS, CSS, images, and swf. </p>"},{"subtitle":"3. Note on use","description":"<p>Although most libraries are open source based on the MIT/BSD License, some libraries are different in personal/commercial applications, such as the Highcharts library, so please be careful when using these libraries. Fortunately, you can click on its website and code repository (links in the search results) to view its open source agreement. </p>"},{"subtitle":"4. Authors and service providers","description":"<p>Current maintainer:</p> <p><a href='https://github.com/ikbear' target='_blank'>• ikbear</a></p> <p><a href='https://github.com/iwillwen' target='_blank'>• iwillwen</a></p> <p><a href='https://github.com/DL-strong' target='_blank'>• Vortex</a></p> <p>Historical maintainer:</p> <p><a href='https://github.com/sofish' target='_blank'>• Sofish</a></p> <p><a href='https://github.com/hfcorriez' target='_blank'>• hfcorriez</a></p> <p><a href='https://github.com/sorcerer-ma' target='_blank'>• Ma Yiqing </a></p> This warehouse is sponsored by the cloud storage service provider <a href='https://www.qiniu.com/' target='_blank'>Qiniu Cloud</a> for storage and acceleration. Synchronize with foreign <a href='https://cdnjs.com' target='_blank'>CDNS</a> source sites, and submit other valuable libraries through domestic open source contributions. Thanks to all open source library authors and miners for their efforts."},{"subtitle":"5. Open source agreement","description":"It is open source based on the MIT License."}]}]},"__N_SSG":true}