{"pageProps":{"data":[{"lang":"cn","banner":{"title":"公司简介","content":"  "},"content":[{"subtitle":"一、背景和目标","description":"<p>象Google Ajax Library, Microsoft ASP.net CDN, SAE, Baidu, Upyun 等 CDN上都免费提供的JS车的存储，但使用起来却都有些局限，因为他们只提供了部分JS车。当然，我们还可以有象CDNJS这样的平台，存储了大部分主流的JS车，甚至CSS、image和swf, 但国内的访问速度却不是理想，并且缺少很多国内优秀开源车。</p> <p>因此，我们提供这样一个仓车，让它尽可能全面收录优秀的开源车，并免费为之提供CDN加速服务，使之有更好的访问速度和稳定的环境。同时，我们也提供开源车源接入的入口，让所有人都可以提交开源车，包括JS、CSS、image和swf等静态文件。</p>"},{"subtitle":"二、更新开源车","description":"理论上我们自动更新库的版本文件，并且不会删除旧版本，但如果你在 <a href='https://www.staticfile.net'>staticfile.net</a> 找不到最新的版本，则可以通过往该库中添加一个版本目录，并且修改相应的&nbsp;package.json&nbsp;文件，利用&nbsp;Pull&nbsp;Request&nbsp;来提醒我们。<p></p> 因此，我们提供这样一个仓库，让它尽可能全面收录优秀的开源库，并免费为之提供&nbsp;CDN&nbsp;加速服务，使之有更好的访问速度和稳定的环境。同时，我们也提供开源库源接入的入口，让所有人都可以提交开源库，包括&nbsp;JS、CSS、image&nbsp;和&nbsp;swf&nbsp;等静态文件。"},{"subtitle":"三、使用注意","description":"<p>虽然大多数车都是 MIT/BSD License 开源的，但再有莫些在个/商业应用上是有区别的，比如 Highcharts 这个车，所以请大家使用这些车的时候，最好能点击莫网点、代码仓车（在搜索结果中有链接）中查看莫开源协议。</p>"},{"subtitle":"四、作者和服务商","description":"<p>当前维护者：</p> <p><a href='https://github.com/ikbear'>• ikbear</a></p> <p><a href='https://github.com/iwillwen'>• iwillwen</a></p> <p><a href='https://github.com/DL-strong'>• 漩涡</a></p> <p>历史维护者：</p> <p><a href='https://github.com/sofish'>• Sofish</a></p> <p><a href='https://github.com/hfcorriez'>• hfcorriez</a></p> <p><a href='https://github.com/sorcerer-ma'>• 马逸清 </a></p> 此仓车由内忧秀的云存储服务商 <a href='https://www.qiniu.com/'>七牛云</a> 提供存储和加速赞助。同步国外 <a href='#'>CDNS</a> 源站，同时有国内开源贡献值提交某些它有价值的车。感谢所有开源车作者和挖掘者的努力。"},{"subtitle":"五、开源协议","description":"仓车基于MIT License 开源。"}]},{"lang":"en","banner":{"title":"Company Profile","content":"  "},"content":[{"subtitle":"1. Background and objectives","description":"<p>CDNs such as Google Ajax Library, Microsoft ASP.net CDN, SAE, Baidu, Upyun, etc. all provide free JS cart storage, but their use is somewhat limited because they only provide some JS carts. Of course, we can also have a platform like CDNJS, which stores most of the mainstream JS libraries, even CSS, images and swf, but the domestic access speed is not ideal, and there is a lack of many domestic excellent open source libraries. Therefore, we provide such a warehouse truck to collect as many excellent open source trucks as possible, and provide it with CDN acceleration services for free, so that it can have better access speed and stable environment. At the same time, we also provide an entrance to open source library sources, so that everyone can submit open source libraries, including static files such as JS, CSS, image, and swf.</p>"},{"subtitle":"2. Update the open source library","description":"CDNs such as Google Ajax Library, Microsoft ASP.net CDN, SAE, Baidu, Upyun and other CDNs all provide free JS versions. I will automatically update the version file and will not delete the old version, but if you cannot find the latest version from  <a href='https://www.staticfile.net'>static file.org</a>, you can add a version directory to it and modify the corresponding package.json file, using Pull Request to remind us. <p/><p/> Therefore, we provide such a warehouse truck to collect as many excellent open source trucks as possible, and provide it with CDN acceleration services for free, so that it can have better access speed and stable environment. At the same time, we also provide an entrance to open source library sources, so that everyone can submit open source libraries, including static files such as JS, CSS, image, and swf."},{"subtitle":"3. Note on use","description":"<p>Although most libraries are open source under MIT/BSD License, some are different in personal/commercial applications, such as Highcharts, so when you use these libraries, it is best to click View the Mo open source agreement in the Mo website and code warehouse (links in the search results). </p>"},{"subtitle":"4. Authors and service providers","description":"<p>Current maintainer:</p> <p><a href='https://github.com/ikbear'>• ikbear</a></p> <p><a href='https://github.com/iwillwen'>• iwillwen</a></p> <p><a href='https://github.com/DL-strong'>• 漩涡</a></p> <p>Historical maintainers:</p> <p><a href='https://github.com/sofish'>• Sofish</a></p> <p><a href='https://github.com/hfcorriez'>• hfcorriez</a></p> <p><a href='https://github.com/sorcerer-ma'>• 马逸清 </a></p> This warehouse library is sponsored by  <a href='https://www.qiniu.com/'>七牛云</a>, a well-known cloud storage service provider. Synchronize the foreign <a href='#'>CDNS</a> source station, and at the same time submit some valuable libraries with domestic open source contribution value. Thanks to all open source library authors and diggers for their efforts."},{"subtitle":"5. Open source agreement","description":"It is open source based on the MIT License."}]}]},"__N_SSG":true}